SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeua_template/common/hc32f460jeua.h
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT0             (*((volatile unsigned int*)(0x42A68E50UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT1             (*((volatile unsigned int*)(0x42A68E54UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT2             (*((volatile unsigned int*)(0x42A68E58UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT3             (*((volatile unsigned int*)(0x42A68E5CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT4             (*((volatile unsigned int*)(0x42A68E60UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT5             (*((volatile unsigned int*)(0x42A68E64UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT6             (*((volatile unsigned int*)(0x42A68E68UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT7             (*((volatile unsigned int*)(0x42A68E6CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT8             (*((volatile unsigned int*)(0x42A68E70UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT9             (*((volatile unsigned int*)(0x42A68E74UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT10            (*((volatile unsigned int*)(0x42A68E78UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT11            (*((volatile unsigned int*)(0x42A68E7CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET0            (*((volatile unsigned int*)(0x42A68E80UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET1            (*((volatile unsigned int*)(0x42A68E84UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET2            (*((volatile unsigned int*)(0x42A68E88UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET3            (*((volatile unsigned int*)(0x42A68E8CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET4            (*((volatile unsigned int*)(0x42A68E90UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET5            (*((volatile unsigned int*)(0x42A68E94UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET6            (*((volatile unsigned int*)(0x42A68E98UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET7            (*((volatile unsigned int*)(0x42A68E9CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET8            (*((volatile unsigned int*)(0x42A68EA0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET9            (*((volatile unsigned int*)(0x42A68EA4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET10           (*((volatile unsigned int*)(0x42A68EA8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET11           (*((volatile unsigned int*)(0x42A68EACUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET12           (*((volatile unsigned int*)(0x42A68EB0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET13           (*((volatile unsigned int*)(0x42A68EB4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET14           (*((volatile unsigned int*)(0x42A68EB8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET15           (*((volatile unsigned int*)(0x42A68EBCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET16           (*((volatile unsigned int*)(0x42A68EC0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET17           (*((volatile unsigned int*)(0x42A68EC4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET18           (*((volatile unsigned int*)(0x42A68EC8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET19           (*((volatile unsigned int*)(0x42A68ECCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT0             (*((volatile unsigned int*)(0x42A68ED0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT1             (*((volatile unsigned int*)(0x42A68ED4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT2             (*((volatile unsigned int*)(0x42A68ED8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT3             (*((volatile unsigned int*)(0x42A68EDCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT4             (*((volatile unsigned int*)(0x42A68EE0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT5             (*((volatile unsigned int*)(0x42A68EE4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT6             (*((volatile unsigned int*)(0x42A68EE8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT7             (*((volatile unsigned int*)(0x42A68EECUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT8             (*((volatile unsigned int*)(0x42A68EF0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT9             (*((volatile unsigned int*)(0x42A68EF4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT10            (*((volatile unsigned int*)(0x42A68EF8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT11            (*((volatile unsigned int*)(0x42A68EFCUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE0                  (*((volatile unsigned int*)(0x42A69100UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE1                  (*((volatile unsigned int*)(0x42A69104UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE2                  (*((volatile unsigned int*)(0x42A69108UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6910CUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE4                  (*((volatile unsigned int*)(0x42A69110UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE5                  (*((volatile unsigned int*)(0x42A69114UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE6                  (*((volatile unsigned int*)(0x42A69118UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6911CUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE8                  (*((volatile unsigned int*)(0x42A69120UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE9                  (*((volatile unsigned int*)(0x42A69124UL)))
#define bM4_DMA2_DTCTL1_CNT0                      (*((volatile unsigned int*)(0x42A69140UL)))
#define bM4_DMA2_DTCTL1_CNT1                      (*((volatile unsigned int*)(0x42A69144UL)))
#define bM4_DMA2_DTCTL1_CNT2                      (*((volatile unsigned int*)(0x42A69148UL)))
#define bM4_DMA2_DTCTL1_CNT3                      (*((volatile unsigned int*)(0x42A6914CUL)))
#define bM4_DMA2_DTCTL1_CNT4                      (*((volatile unsigned int*)(0x42A69150UL)))
#define bM4_DMA2_DTCTL1_CNT5                      (*((volatile unsigned int*)(0x42A69154UL)))
#define bM4_DMA2_DTCTL1_CNT6                      (*((volatile unsigned int*)(0x42A69158UL)))
#define bM4_DMA2_DTCTL1_CNT7                      (*((volatile unsigned int*)(0x42A6915CUL)))
#define bM4_DMA2_DTCTL1_CNT8                      (*((volatile unsigned int*)(0x42A69160UL)))
#define bM4_DMA2_DTCTL1_CNT9                      (*((volatile unsigned int*)(0x42A69164UL)))
#define bM4_DMA2_DTCTL1_CNT10                     (*((volatile unsigned int*)(0x42A69168UL)))
#define bM4_DMA2_DTCTL1_CNT11                     (*((volatile unsigned int*)(0x42A6916CUL)))
#define bM4_DMA2_DTCTL1_CNT12                     (*((volatile unsigned int*)(0x42A69170UL)))
#define bM4_DMA2_DTCTL1_CNT13                     (*((volatile unsigned int*)(0x42A69174UL)))
#define bM4_DMA2_DTCTL1_CNT14                     (*((volatile unsigned int*)(0x42A69178UL)))
#define bM4_DMA2_DTCTL1_CNT15                     (*((volatile unsigned int*)(0x42A6917CUL)))
#define bM4_DMA2_RPT1_SRPT0                       (*((volatile unsigned int*)(0x42A69180UL)))
#define bM4_DMA2_RPT1_SRPT1                       (*((volatile unsigned int*)(0x42A69184UL)))
#define bM4_DMA2_RPT1_SRPT2                       (*((volatile unsigned int*)(0x42A69188UL)))
#define bM4_DMA2_RPT1_SRPT3                       (*((volatile unsigned int*)(0x42A6918CUL)))
#define bM4_DMA2_RPT1_SRPT4                       (*((volatile unsigned int*)(0x42A69190UL)))
#define bM4_DMA2_RPT1_SRPT5                       (*((volatile unsigned int*)(0x42A69194UL)))
#define bM4_DMA2_RPT1_SRPT6                       (*((volatile unsigned int*)(0x42A69198UL)))
#define bM4_DMA2_RPT1_SRPT7                       (*((volatile unsigned int*)(0x42A6919CUL)))
#define bM4_DMA2_RPT1_SRPT8                       (*((volatile unsigned int*)(0x42A691A0UL)))
#define bM4_DMA2_RPT1_SRPT9                       (*((volatile unsigned int*)(0x42A691A4UL)))
#define bM4_DMA2_RPT1_DRPT0                       (*((volatile unsigned int*)(0x42A691C0UL)))
#define bM4_DMA2_RPT1_DRPT1                       (*((volatile unsigned int*)(0x42A691C4UL)))
#define bM4_DMA2_RPT1_DRPT2                       (*((volatile unsigned int*)(0x42A691C8UL)))
#define bM4_DMA2_RPT1_DRPT3                       (*((volatile unsigned int*)(0x42A691CCUL)))
#define bM4_DMA2_RPT1_DRPT4                       (*((volatile unsigned int*)(0x42A691D0UL)))
#define bM4_DMA2_RPT1_DRPT5                       (*((volatile unsigned int*)(0x42A691D4UL)))
#define bM4_DMA2_RPT1_DRPT6                       (*((volatile unsigned int*)(0x42A691D8UL)))
#define bM4_DMA2_RPT1_DRPT7                       (*((volatile unsigned int*)(0x42A691DCUL)))
#define bM4_DMA2_RPT1_DRPT8                       (*((volatile unsigned int*)(0x42A691E0UL)))
#define bM4_DMA2_RPT1_DRPT9                       (*((volatile unsigned int*)(0x42A691E4UL)))
#define bM4_DMA2_RPTB1_SRPTB0                     (*((volatile unsigned int*)(0x42A69180UL)))
#define bM4_DMA2_RPTB1_SRPTB1                     (*((volatile unsigned int*)(0x42A69184UL)))
#define bM4_DMA2_RPTB1_SRPTB2                     (*((volatile unsigned int*)(0x42A69188UL)))
#define bM4_DMA2_RPTB1_SRPTB3                     (*((volatile unsigned int*)(0x42A6918CUL)))
#define bM4_DMA2_RPTB1_SRPTB4                     (*((volatile unsigned int*)(0x42A69190UL)))
#define bM4_DMA2_RPTB1_SRPTB5                     (*((volatile unsigned int*)(0x42A69194UL)))
#define bM4_DMA2_RPTB1_SRPTB6                     (*((volatile unsigned int*)(0x42A69198UL)))
#define bM4_DMA2_RPTB1_SRPTB7                     (*((volatile unsigned int*)(0x42A6919CUL)))
#define bM4_DMA2_RPTB1_SRPTB8                     (*((volatile unsigned int*)(0x42A691A0UL)))
#define bM4_DMA2_RPTB1_SRPTB9                     (*((volatile unsigned int*)(0x42A691A4UL)))
#define bM4_DMA2_RPTB1_DRPTB0                     (*((volatile unsigned int*)(0x42A691C0UL)))
#define bM4_DMA2_RPTB1_DRPTB1                     (*((volatile unsigned int*)(0x42A691C4UL)))
#define bM4_DMA2_RPTB1_DRPTB2                     (*((volatile unsigned int*)(0x42A691C8UL)))
#define bM4_DMA2_RPTB1_DRPTB3                     (*((volatile unsigned int*)(0x42A691CCUL)))
#define bM4_DMA2_RPTB1_DRPTB4                     (*((volatile unsigned int*)(0x42A691D0UL)))
#define bM4_DMA2_RPTB1_DRPTB5                     (*((volatile unsigned int*)(0x42A691D4UL)))
#define bM4_DMA2_RPTB1_DRPTB6                     (*((volatile unsigned int*)(0x42A691D8UL)))
#define bM4_DMA2_RPTB1_DRPTB7                     (*((volatile unsigned int*)(0x42A691DCUL)))
#define bM4_DMA2_RPTB1_DRPTB8                     (*((volatile unsigned int*)(0x42A691E0UL)))
#define bM4_DMA2_RPTB1_DRPTB9                     (*((volatile unsigned int*)(0x42A691E4UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET0               (*((volatile unsigned int*)(0x42A69200UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET1               (*((volatile unsigned int*)(0x42A69204UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET2               (*((volatile unsigned int*)(0x42A69208UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET3               (*((volatile unsigned int*)(0x42A6920CUL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET4               (*((volatile unsigned int*)(0x42A69210UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET5               (*((volatile unsigned int*)(0x42A69214UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET6               (*((volatile unsigned int*)(0x42A69218UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET7               (*((volatile unsigned int*)(0x42A6921CUL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET8               (*((volatile unsigned int*)(0x42A69220UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET9               (*((volatile unsigned int*)(0x42A69224UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET10              (*((volatile unsigned int*)(0x42A69228UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET11              (*((volatile unsigned int*)(0x42A6922CUL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET12              (*((volatile unsigned int*)(0x42A69230UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET13              (*((volatile unsigned int*)(0x42A69234UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET14              (*((volatile unsigned int*)(0x42A69238UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET15              (*((volatile unsigned int*)(0x42A6923CUL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET16              (*((volatile unsigned int*)(0x42A69240UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET17              (*((volatile unsigned int*)(0x42A69244UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET18              (*((volatile unsigned int*)(0x42A69248UL)))
#define bM4_DMA2_SNSEQCTL1_SOFFSET19              (*((volatile unsigned int*)(0x42A6924CUL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT0                (*((volatile unsigned int*)(0x42A69250UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT1                (*((volatile unsigned int*)(0x42A69254UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT2                (*((volatile unsigned int*)(0x42A69258UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT3                (*((volatile unsigned int*)(0x42A6925CUL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT4                (*((volatile unsigned int*)(0x42A69260UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT5                (*((volatile unsigned int*)(0x42A69264UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT6                (*((volatile unsigned int*)(0x42A69268UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT7                (*((volatile unsigned int*)(0x42A6926CUL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT8                (*((volatile unsigned int*)(0x42A69270UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT9                (*((volatile unsigned int*)(0x42A69274UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT10               (*((volatile unsigned int*)(0x42A69278UL)))
#define bM4_DMA2_SNSEQCTL1_SNSCNT11               (*((volatile unsigned int*)(0x42A6927CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST0              (*((volatile unsigned int*)(0x42A69200UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST1              (*((volatile unsigned int*)(0x42A69204UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST2              (*((volatile unsigned int*)(0x42A69208UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST3              (*((volatile unsigned int*)(0x42A6920CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST4              (*((volatile unsigned int*)(0x42A69210UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST5              (*((volatile unsigned int*)(0x42A69214UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST6              (*((volatile unsigned int*)(0x42A69218UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST7              (*((volatile unsigned int*)(0x42A6921CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST8              (*((volatile unsigned int*)(0x42A69220UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST9              (*((volatile unsigned int*)(0x42A69224UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST10             (*((volatile unsigned int*)(0x42A69228UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST11             (*((volatile unsigned int*)(0x42A6922CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST12             (*((volatile unsigned int*)(0x42A69230UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST13             (*((volatile unsigned int*)(0x42A69234UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST14             (*((volatile unsigned int*)(0x42A69238UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST15             (*((volatile unsigned int*)(0x42A6923CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST16             (*((volatile unsigned int*)(0x42A69240UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST17             (*((volatile unsigned int*)(0x42A69244UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST18             (*((volatile unsigned int*)(0x42A69248UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST19             (*((volatile unsigned int*)(0x42A6924CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB0              (*((volatile unsigned int*)(0x42A69250UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB1              (*((volatile unsigned int*)(0x42A69254UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB2              (*((volatile unsigned int*)(0x42A69258UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB3              (*((volatile unsigned int*)(0x42A6925CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB4              (*((volatile unsigned int*)(0x42A69260UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB5              (*((volatile unsigned int*)(0x42A69264UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB6              (*((volatile unsigned int*)(0x42A69268UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB7              (*((volatile unsigned int*)(0x42A6926CUL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB8              (*((volatile unsigned int*)(0x42A69270UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB9              (*((volatile unsigned int*)(0x42A69274UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB10             (*((volatile unsigned int*)(0x42A69278UL)))
#define bM4_DMA2_SNSEQCTLB1_SNSCNTB11             (*((volatile unsigned int*)(0x42A6927CUL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET0               (*((volatile unsigned int*)(0x42A69280UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET1               (*((volatile unsigned int*)(0x42A69284UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET2               (*((volatile unsigned int*)(0x42A69288UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET3               (*((volatile unsigned int*)(0x42A6928CUL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET4               (*((volatile unsigned int*)(0x42A69290UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET5               (*((volatile unsigned int*)(0x42A69294UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET6               (*((volatile unsigned int*)(0x42A69298UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET7               (*((volatile unsigned int*)(0x42A6929CUL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET8               (*((volatile unsigned int*)(0x42A692A0UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET9               (*((volatile unsigned int*)(0x42A692A4UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET10              (*((volatile unsigned int*)(0x42A692A8UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET11              (*((volatile unsigned int*)(0x42A692ACUL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET12              (*((volatile unsigned int*)(0x42A692B0UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET13              (*((volatile unsigned int*)(0x42A692B4UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET14              (*((volatile unsigned int*)(0x42A692B8UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET15              (*((volatile unsigned int*)(0x42A692BCUL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET16              (*((volatile unsigned int*)(0x42A692C0UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET17              (*((volatile unsigned int*)(0x42A692C4UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET18              (*((volatile unsigned int*)(0x42A692C8UL)))
#define bM4_DMA2_DNSEQCTL1_DOFFSET19              (*((volatile unsigned int*)(0x42A692CCUL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT0                (*((volatile unsigned int*)(0x42A692D0UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT1                (*((volatile unsigned int*)(0x42A692D4UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT2                (*((volatile unsigned int*)(0x42A692D8UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT3                (*((volatile unsigned int*)(0x42A692DCUL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT4                (*((volatile unsigned int*)(0x42A692E0UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT5                (*((volatile unsigned int*)(0x42A692E4UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT6                (*((volatile unsigned int*)(0x42A692E8UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT7                (*((volatile unsigned int*)(0x42A692ECUL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT8                (*((volatile unsigned int*)(0x42A692F0UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT9                (*((volatile unsigned int*)(0x42A692F4UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT10               (*((volatile unsigned int*)(0x42A692F8UL)))
#define bM4_DMA2_DNSEQCTL1_DNSCNT11               (*((volatile unsigned int*)(0x42A692FCUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST0              (*((volatile unsigned int*)(0x42A69280UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST1              (*((volatile unsigned int*)(0x42A69284UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST2              (*((volatile unsigned int*)(0x42A69288UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST3              (*((volatile unsigned int*)(0x42A6928CUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST4              (*((volatile unsigned int*)(0x42A69290UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST5              (*((volatile unsigned int*)(0x42A69294UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST6              (*((volatile unsigned int*)(0x42A69298UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST7              (*((volatile unsigned int*)(0x42A6929CUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST8              (*((volatile unsigned int*)(0x42A692A0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST9              (*((volatile unsigned int*)(0x42A692A4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST10             (*((volatile unsigned int*)(0x42A692A8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST11             (*((volatile unsigned int*)(0x42A692ACUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST12             (*((volatile unsigned int*)(0x42A692B0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST13             (*((volatile unsigned int*)(0x42A692B4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST14             (*((volatile unsigned int*)(0x42A692B8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST15             (*((volatile unsigned int*)(0x42A692BCUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST16             (*((volatile unsigned int*)(0x42A692C0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST17             (*((volatile unsigned int*)(0x42A692C4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST18             (*((volatile unsigned int*)(0x42A692C8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSDIST19             (*((volatile unsigned int*)(0x42A692CCUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB0              (*((volatile unsigned int*)(0x42A692D0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB1              (*((volatile unsigned int*)(0x42A692D4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB2              (*((volatile unsigned int*)(0x42A692D8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB3              (*((volatile unsigned int*)(0x42A692DCUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB4              (*((volatile unsigned int*)(0x42A692E0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB5              (*((volatile unsigned int*)(0x42A692E4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB6              (*((volatile unsigned int*)(0x42A692E8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB7              (*((volatile unsigned int*)(0x42A692ECUL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB8              (*((volatile unsigned int*)(0x42A692F0UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB9              (*((volatile unsigned int*)(0x42A692F4UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB10             (*((volatile unsigned int*)(0x42A692F8UL)))
#define bM4_DMA2_DNSEQCTLB1_DNSCNTB11             (*((volatile unsigned int*)(0x42A692FCUL)))
#define bM4_DMA2_LLP1_LLP0                        (*((volatile unsigned int*)(0x42A69308UL)))
#define bM4_DMA2_LLP1_LLP1                        (*((volatile unsigned int*)(0x42A6930CUL)))
#define bM4_DMA2_LLP1_LLP2                        (*((volatile unsigned int*)(0x42A69310UL)))
#define bM4_DMA2_LLP1_LLP3                        (*((volatile unsigned int*)(0x42A69314UL)))
#define bM4_DMA2_LLP1_LLP4                        (*((volatile unsigned int*)(0x42A69318UL)))
#define bM4_DMA2_LLP1_LLP5                        (*((volatile unsigned int*)(0x42A6931CUL)))
#define bM4_DMA2_LLP1_LLP6                        (*((volatile unsigned int*)(0x42A69320UL)))
#define bM4_DMA2_LLP1_LLP7                        (*((volatile unsigned int*)(0x42A69324UL)))
#define bM4_DMA2_LLP1_LLP8                        (*((volatile unsigned int*)(0x42A69328UL)))
#define bM4_DMA2_LLP1_LLP9                        (*((volatile unsigned int*)(0x42A6932CUL)))
#define bM4_DMA2_LLP1_LLP10                       (*((volatile unsigned int*)(0x42A69330UL)))
#define bM4_DMA2_LLP1_LLP11                       (*((volatile unsigned int*)(0x42A69334UL)))
#define bM4_DMA2_LLP1_LLP12                       (*((volatile unsigned int*)(0x42A69338UL)))
#define bM4_DMA2_LLP1_LLP13                       (*((volatile unsigned int*)(0x42A6933CUL)))
#define bM4_DMA2_LLP1_LLP14                       (*((volatile unsigned int*)(0x42A69340UL)))
#define bM4_DMA2_LLP1_LLP15                       (*((volatile unsigned int*)(0x42A69344UL)))
#define bM4_DMA2_LLP1_LLP16                       (*((volatile unsigned int*)(0x42A69348UL)))
