SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeua_template/common/hc32f460jeua.h
#define bM4_DMA2_LLP1_LLP17                       (*((volatile unsigned int*)(0x42A6934CUL)))
#define bM4_DMA2_LLP1_LLP18                       (*((volatile unsigned int*)(0x42A69350UL)))
#define bM4_DMA2_LLP1_LLP19                       (*((volatile unsigned int*)(0x42A69354UL)))
#define bM4_DMA2_LLP1_LLP20                       (*((volatile unsigned int*)(0x42A69358UL)))
#define bM4_DMA2_LLP1_LLP21                       (*((volatile unsigned int*)(0x42A6935CUL)))
#define bM4_DMA2_LLP1_LLP22                       (*((volatile unsigned int*)(0x42A69360UL)))
#define bM4_DMA2_LLP1_LLP23                       (*((volatile unsigned int*)(0x42A69364UL)))
#define bM4_DMA2_LLP1_LLP24                       (*((volatile unsigned int*)(0x42A69368UL)))
#define bM4_DMA2_LLP1_LLP25                       (*((volatile unsigned int*)(0x42A6936CUL)))
#define bM4_DMA2_LLP1_LLP26                       (*((volatile unsigned int*)(0x42A69370UL)))
#define bM4_DMA2_LLP1_LLP27                       (*((volatile unsigned int*)(0x42A69374UL)))
#define bM4_DMA2_LLP1_LLP28                       (*((volatile unsigned int*)(0x42A69378UL)))
#define bM4_DMA2_LLP1_LLP29                       (*((volatile unsigned int*)(0x42A6937CUL)))
#define bM4_DMA2_CH1CTL_SINC0                     (*((volatile unsigned int*)(0x42A69380UL)))
#define bM4_DMA2_CH1CTL_SINC1                     (*((volatile unsigned int*)(0x42A69384UL)))
#define bM4_DMA2_CH1CTL_DINC0                     (*((volatile unsigned int*)(0x42A69388UL)))
#define bM4_DMA2_CH1CTL_DINC1                     (*((volatile unsigned int*)(0x42A6938CUL)))
#define bM4_DMA2_CH1CTL_SRPTEN                    (*((volatile unsigned int*)(0x42A69390UL)))
#define bM4_DMA2_CH1CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A69394UL)))
#define bM4_DMA2_CH1CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A69398UL)))
#define bM4_DMA2_CH1CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A6939CUL)))
#define bM4_DMA2_CH1CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A693A0UL)))
#define bM4_DMA2_CH1CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A693A4UL)))
#define bM4_DMA2_CH1CTL_LLPEN                     (*((volatile unsigned int*)(0x42A693A8UL)))
#define bM4_DMA2_CH1CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A693ACUL)))
#define bM4_DMA2_CH1CTL_IE                        (*((volatile unsigned int*)(0x42A693B0UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE0               (*((volatile unsigned int*)(0x42A69500UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE1               (*((volatile unsigned int*)(0x42A69504UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE2               (*((volatile unsigned int*)(0x42A69508UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE3               (*((volatile unsigned int*)(0x42A6950CUL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE4               (*((volatile unsigned int*)(0x42A69510UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE5               (*((volatile unsigned int*)(0x42A69514UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE6               (*((volatile unsigned int*)(0x42A69518UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE7               (*((volatile unsigned int*)(0x42A6951CUL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE8               (*((volatile unsigned int*)(0x42A69520UL)))
#define bM4_DMA2_MONDTCTL1_BLKSIZE9               (*((volatile unsigned int*)(0x42A69524UL)))
#define bM4_DMA2_MONDTCTL1_CNT0                   (*((volatile unsigned int*)(0x42A69540UL)))
#define bM4_DMA2_MONDTCTL1_CNT1                   (*((volatile unsigned int*)(0x42A69544UL)))
#define bM4_DMA2_MONDTCTL1_CNT2                   (*((volatile unsigned int*)(0x42A69548UL)))
#define bM4_DMA2_MONDTCTL1_CNT3                   (*((volatile unsigned int*)(0x42A6954CUL)))
#define bM4_DMA2_MONDTCTL1_CNT4                   (*((volatile unsigned int*)(0x42A69550UL)))
#define bM4_DMA2_MONDTCTL1_CNT5                   (*((volatile unsigned int*)(0x42A69554UL)))
#define bM4_DMA2_MONDTCTL1_CNT6                   (*((volatile unsigned int*)(0x42A69558UL)))
#define bM4_DMA2_MONDTCTL1_CNT7                   (*((volatile unsigned int*)(0x42A6955CUL)))
#define bM4_DMA2_MONDTCTL1_CNT8                   (*((volatile unsigned int*)(0x42A69560UL)))
#define bM4_DMA2_MONDTCTL1_CNT9                   (*((volatile unsigned int*)(0x42A69564UL)))
#define bM4_DMA2_MONDTCTL1_CNT10                  (*((volatile unsigned int*)(0x42A69568UL)))
#define bM4_DMA2_MONDTCTL1_CNT11                  (*((volatile unsigned int*)(0x42A6956CUL)))
#define bM4_DMA2_MONDTCTL1_CNT12                  (*((volatile unsigned int*)(0x42A69570UL)))
#define bM4_DMA2_MONDTCTL1_CNT13                  (*((volatile unsigned int*)(0x42A69574UL)))
#define bM4_DMA2_MONDTCTL1_CNT14                  (*((volatile unsigned int*)(0x42A69578UL)))
#define bM4_DMA2_MONDTCTL1_CNT15                  (*((volatile unsigned int*)(0x42A6957CUL)))
#define bM4_DMA2_MONRPT1_SRPT0                    (*((volatile unsigned int*)(0x42A69580UL)))
#define bM4_DMA2_MONRPT1_SRPT1                    (*((volatile unsigned int*)(0x42A69584UL)))
#define bM4_DMA2_MONRPT1_SRPT2                    (*((volatile unsigned int*)(0x42A69588UL)))
#define bM4_DMA2_MONRPT1_SRPT3                    (*((volatile unsigned int*)(0x42A6958CUL)))
#define bM4_DMA2_MONRPT1_SRPT4                    (*((volatile unsigned int*)(0x42A69590UL)))
#define bM4_DMA2_MONRPT1_SRPT5                    (*((volatile unsigned int*)(0x42A69594UL)))
#define bM4_DMA2_MONRPT1_SRPT6                    (*((volatile unsigned int*)(0x42A69598UL)))
#define bM4_DMA2_MONRPT1_SRPT7                    (*((volatile unsigned int*)(0x42A6959CUL)))
#define bM4_DMA2_MONRPT1_SRPT8                    (*((volatile unsigned int*)(0x42A695A0UL)))
#define bM4_DMA2_MONRPT1_SRPT9                    (*((volatile unsigned int*)(0x42A695A4UL)))
#define bM4_DMA2_MONRPT1_DRPT0                    (*((volatile unsigned int*)(0x42A695C0UL)))
#define bM4_DMA2_MONRPT1_DRPT1                    (*((volatile unsigned int*)(0x42A695C4UL)))
#define bM4_DMA2_MONRPT1_DRPT2                    (*((volatile unsigned int*)(0x42A695C8UL)))
#define bM4_DMA2_MONRPT1_DRPT3                    (*((volatile unsigned int*)(0x42A695CCUL)))
#define bM4_DMA2_MONRPT1_DRPT4                    (*((volatile unsigned int*)(0x42A695D0UL)))
#define bM4_DMA2_MONRPT1_DRPT5                    (*((volatile unsigned int*)(0x42A695D4UL)))
#define bM4_DMA2_MONRPT1_DRPT6                    (*((volatile unsigned int*)(0x42A695D8UL)))
#define bM4_DMA2_MONRPT1_DRPT7                    (*((volatile unsigned int*)(0x42A695DCUL)))
#define bM4_DMA2_MONRPT1_DRPT8                    (*((volatile unsigned int*)(0x42A695E0UL)))
#define bM4_DMA2_MONRPT1_DRPT9                    (*((volatile unsigned int*)(0x42A695E4UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET0            (*((volatile unsigned int*)(0x42A69600UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET1            (*((volatile unsigned int*)(0x42A69604UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET2            (*((volatile unsigned int*)(0x42A69608UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET3            (*((volatile unsigned int*)(0x42A6960CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET4            (*((volatile unsigned int*)(0x42A69610UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET5            (*((volatile unsigned int*)(0x42A69614UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET6            (*((volatile unsigned int*)(0x42A69618UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET7            (*((volatile unsigned int*)(0x42A6961CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET8            (*((volatile unsigned int*)(0x42A69620UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET9            (*((volatile unsigned int*)(0x42A69624UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET10           (*((volatile unsigned int*)(0x42A69628UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET11           (*((volatile unsigned int*)(0x42A6962CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET12           (*((volatile unsigned int*)(0x42A69630UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET13           (*((volatile unsigned int*)(0x42A69634UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET14           (*((volatile unsigned int*)(0x42A69638UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET15           (*((volatile unsigned int*)(0x42A6963CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET16           (*((volatile unsigned int*)(0x42A69640UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET17           (*((volatile unsigned int*)(0x42A69644UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET18           (*((volatile unsigned int*)(0x42A69648UL)))
#define bM4_DMA2_MONSNSEQCTL1_SOFFSET19           (*((volatile unsigned int*)(0x42A6964CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT0             (*((volatile unsigned int*)(0x42A69650UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT1             (*((volatile unsigned int*)(0x42A69654UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT2             (*((volatile unsigned int*)(0x42A69658UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT3             (*((volatile unsigned int*)(0x42A6965CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT4             (*((volatile unsigned int*)(0x42A69660UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT5             (*((volatile unsigned int*)(0x42A69664UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT6             (*((volatile unsigned int*)(0x42A69668UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT7             (*((volatile unsigned int*)(0x42A6966CUL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT8             (*((volatile unsigned int*)(0x42A69670UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT9             (*((volatile unsigned int*)(0x42A69674UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT10            (*((volatile unsigned int*)(0x42A69678UL)))
#define bM4_DMA2_MONSNSEQCTL1_SNSCNT11            (*((volatile unsigned int*)(0x42A6967CUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET0            (*((volatile unsigned int*)(0x42A69680UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET1            (*((volatile unsigned int*)(0x42A69684UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET2            (*((volatile unsigned int*)(0x42A69688UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET3            (*((volatile unsigned int*)(0x42A6968CUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET4            (*((volatile unsigned int*)(0x42A69690UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET5            (*((volatile unsigned int*)(0x42A69694UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET6            (*((volatile unsigned int*)(0x42A69698UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET7            (*((volatile unsigned int*)(0x42A6969CUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET8            (*((volatile unsigned int*)(0x42A696A0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET9            (*((volatile unsigned int*)(0x42A696A4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET10           (*((volatile unsigned int*)(0x42A696A8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET11           (*((volatile unsigned int*)(0x42A696ACUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET12           (*((volatile unsigned int*)(0x42A696B0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET13           (*((volatile unsigned int*)(0x42A696B4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET14           (*((volatile unsigned int*)(0x42A696B8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET15           (*((volatile unsigned int*)(0x42A696BCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET16           (*((volatile unsigned int*)(0x42A696C0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET17           (*((volatile unsigned int*)(0x42A696C4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET18           (*((volatile unsigned int*)(0x42A696C8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET19           (*((volatile unsigned int*)(0x42A696CCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT0             (*((volatile unsigned int*)(0x42A696D0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT1             (*((volatile unsigned int*)(0x42A696D4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT2             (*((volatile unsigned int*)(0x42A696D8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT3             (*((volatile unsigned int*)(0x42A696DCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT4             (*((volatile unsigned int*)(0x42A696E0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT5             (*((volatile unsigned int*)(0x42A696E4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT6             (*((volatile unsigned int*)(0x42A696E8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT7             (*((volatile unsigned int*)(0x42A696ECUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT8             (*((volatile unsigned int*)(0x42A696F0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT9             (*((volatile unsigned int*)(0x42A696F4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT10            (*((volatile unsigned int*)(0x42A696F8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT11            (*((volatile unsigned int*)(0x42A696FCUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE0                  (*((volatile unsigned int*)(0x42A69900UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE1                  (*((volatile unsigned int*)(0x42A69904UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE2                  (*((volatile unsigned int*)(0x42A69908UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6990CUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE4                  (*((volatile unsigned int*)(0x42A69910UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE5                  (*((volatile unsigned int*)(0x42A69914UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE6                  (*((volatile unsigned int*)(0x42A69918UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6991CUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE8                  (*((volatile unsigned int*)(0x42A69920UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE9                  (*((volatile unsigned int*)(0x42A69924UL)))
#define bM4_DMA2_DTCTL2_CNT0                      (*((volatile unsigned int*)(0x42A69940UL)))
#define bM4_DMA2_DTCTL2_CNT1                      (*((volatile unsigned int*)(0x42A69944UL)))
#define bM4_DMA2_DTCTL2_CNT2                      (*((volatile unsigned int*)(0x42A69948UL)))
#define bM4_DMA2_DTCTL2_CNT3                      (*((volatile unsigned int*)(0x42A6994CUL)))
#define bM4_DMA2_DTCTL2_CNT4                      (*((volatile unsigned int*)(0x42A69950UL)))
#define bM4_DMA2_DTCTL2_CNT5                      (*((volatile unsigned int*)(0x42A69954UL)))
#define bM4_DMA2_DTCTL2_CNT6                      (*((volatile unsigned int*)(0x42A69958UL)))
#define bM4_DMA2_DTCTL2_CNT7                      (*((volatile unsigned int*)(0x42A6995CUL)))
#define bM4_DMA2_DTCTL2_CNT8                      (*((volatile unsigned int*)(0x42A69960UL)))
#define bM4_DMA2_DTCTL2_CNT9                      (*((volatile unsigned int*)(0x42A69964UL)))
#define bM4_DMA2_DTCTL2_CNT10                     (*((volatile unsigned int*)(0x42A69968UL)))
#define bM4_DMA2_DTCTL2_CNT11                     (*((volatile unsigned int*)(0x42A6996CUL)))
#define bM4_DMA2_DTCTL2_CNT12                     (*((volatile unsigned int*)(0x42A69970UL)))
#define bM4_DMA2_DTCTL2_CNT13                     (*((volatile unsigned int*)(0x42A69974UL)))
#define bM4_DMA2_DTCTL2_CNT14                     (*((volatile unsigned int*)(0x42A69978UL)))
#define bM4_DMA2_DTCTL2_CNT15                     (*((volatile unsigned int*)(0x42A6997CUL)))
#define bM4_DMA2_RPT2_SRPT0                       (*((volatile unsigned int*)(0x42A69980UL)))
#define bM4_DMA2_RPT2_SRPT1                       (*((volatile unsigned int*)(0x42A69984UL)))
#define bM4_DMA2_RPT2_SRPT2                       (*((volatile unsigned int*)(0x42A69988UL)))
#define bM4_DMA2_RPT2_SRPT3                       (*((volatile unsigned int*)(0x42A6998CUL)))
#define bM4_DMA2_RPT2_SRPT4                       (*((volatile unsigned int*)(0x42A69990UL)))
#define bM4_DMA2_RPT2_SRPT5                       (*((volatile unsigned int*)(0x42A69994UL)))
#define bM4_DMA2_RPT2_SRPT6                       (*((volatile unsigned int*)(0x42A69998UL)))
#define bM4_DMA2_RPT2_SRPT7                       (*((volatile unsigned int*)(0x42A6999CUL)))
#define bM4_DMA2_RPT2_SRPT8                       (*((volatile unsigned int*)(0x42A699A0UL)))
#define bM4_DMA2_RPT2_SRPT9                       (*((volatile unsigned int*)(0x42A699A4UL)))
#define bM4_DMA2_RPT2_DRPT0                       (*((volatile unsigned int*)(0x42A699C0UL)))
#define bM4_DMA2_RPT2_DRPT1                       (*((volatile unsigned int*)(0x42A699C4UL)))
#define bM4_DMA2_RPT2_DRPT2                       (*((volatile unsigned int*)(0x42A699C8UL)))
#define bM4_DMA2_RPT2_DRPT3                       (*((volatile unsigned int*)(0x42A699CCUL)))
#define bM4_DMA2_RPT2_DRPT4                       (*((volatile unsigned int*)(0x42A699D0UL)))
#define bM4_DMA2_RPT2_DRPT5                       (*((volatile unsigned int*)(0x42A699D4UL)))
#define bM4_DMA2_RPT2_DRPT6                       (*((volatile unsigned int*)(0x42A699D8UL)))
#define bM4_DMA2_RPT2_DRPT7                       (*((volatile unsigned int*)(0x42A699DCUL)))
#define bM4_DMA2_RPT2_DRPT8                       (*((volatile unsigned int*)(0x42A699E0UL)))
#define bM4_DMA2_RPT2_DRPT9                       (*((volatile unsigned int*)(0x42A699E4UL)))
#define bM4_DMA2_RPTB2_SRPTB0                     (*((volatile unsigned int*)(0x42A69980UL)))
#define bM4_DMA2_RPTB2_SRPTB1                     (*((volatile unsigned int*)(0x42A69984UL)))
#define bM4_DMA2_RPTB2_SRPTB2                     (*((volatile unsigned int*)(0x42A69988UL)))
#define bM4_DMA2_RPTB2_SRPTB3                     (*((volatile unsigned int*)(0x42A6998CUL)))
#define bM4_DMA2_RPTB2_SRPTB4                     (*((volatile unsigned int*)(0x42A69990UL)))
#define bM4_DMA2_RPTB2_SRPTB5                     (*((volatile unsigned int*)(0x42A69994UL)))
#define bM4_DMA2_RPTB2_SRPTB6                     (*((volatile unsigned int*)(0x42A69998UL)))
#define bM4_DMA2_RPTB2_SRPTB7                     (*((volatile unsigned int*)(0x42A6999CUL)))
#define bM4_DMA2_RPTB2_SRPTB8                     (*((volatile unsigned int*)(0x42A699A0UL)))
#define bM4_DMA2_RPTB2_SRPTB9                     (*((volatile unsigned int*)(0x42A699A4UL)))
#define bM4_DMA2_RPTB2_DRPTB0                     (*((volatile unsigned int*)(0x42A699C0UL)))
#define bM4_DMA2_RPTB2_DRPTB1                     (*((volatile unsigned int*)(0x42A699C4UL)))
#define bM4_DMA2_RPTB2_DRPTB2                     (*((volatile unsigned int*)(0x42A699C8UL)))
#define bM4_DMA2_RPTB2_DRPTB3                     (*((volatile unsigned int*)(0x42A699CCUL)))
#define bM4_DMA2_RPTB2_DRPTB4                     (*((volatile unsigned int*)(0x42A699D0UL)))
#define bM4_DMA2_RPTB2_DRPTB5                     (*((volatile unsigned int*)(0x42A699D4UL)))
#define bM4_DMA2_RPTB2_DRPTB6                     (*((volatile unsigned int*)(0x42A699D8UL)))
#define bM4_DMA2_RPTB2_DRPTB7                     (*((volatile unsigned int*)(0x42A699DCUL)))
#define bM4_DMA2_RPTB2_DRPTB8                     (*((volatile unsigned int*)(0x42A699E0UL)))
#define bM4_DMA2_RPTB2_DRPTB9                     (*((volatile unsigned int*)(0x42A699E4UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET0               (*((volatile unsigned int*)(0x42A69A00UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET1               (*((volatile unsigned int*)(0x42A69A04UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET2               (*((volatile unsigned int*)(0x42A69A08UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET3               (*((volatile unsigned int*)(0x42A69A0CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET4               (*((volatile unsigned int*)(0x42A69A10UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET5               (*((volatile unsigned int*)(0x42A69A14UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET6               (*((volatile unsigned int*)(0x42A69A18UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET7               (*((volatile unsigned int*)(0x42A69A1CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET8               (*((volatile unsigned int*)(0x42A69A20UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET9               (*((volatile unsigned int*)(0x42A69A24UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET10              (*((volatile unsigned int*)(0x42A69A28UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET11              (*((volatile unsigned int*)(0x42A69A2CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET12              (*((volatile unsigned int*)(0x42A69A30UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET13              (*((volatile unsigned int*)(0x42A69A34UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET14              (*((volatile unsigned int*)(0x42A69A38UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET15              (*((volatile unsigned int*)(0x42A69A3CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET16              (*((volatile unsigned int*)(0x42A69A40UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET17              (*((volatile unsigned int*)(0x42A69A44UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET18              (*((volatile unsigned int*)(0x42A69A48UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET19              (*((volatile unsigned int*)(0x42A69A4CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT0                (*((volatile unsigned int*)(0x42A69A50UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT1                (*((volatile unsigned int*)(0x42A69A54UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT2                (*((volatile unsigned int*)(0x42A69A58UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT3                (*((volatile unsigned int*)(0x42A69A5CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT4                (*((volatile unsigned int*)(0x42A69A60UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT5                (*((volatile unsigned int*)(0x42A69A64UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT6                (*((volatile unsigned int*)(0x42A69A68UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT7                (*((volatile unsigned int*)(0x42A69A6CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT8                (*((volatile unsigned int*)(0x42A69A70UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT9                (*((volatile unsigned int*)(0x42A69A74UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT10               (*((volatile unsigned int*)(0x42A69A78UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT11               (*((volatile unsigned int*)(0x42A69A7CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST0              (*((volatile unsigned int*)(0x42A69A00UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST1              (*((volatile unsigned int*)(0x42A69A04UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST2              (*((volatile unsigned int*)(0x42A69A08UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST3              (*((volatile unsigned int*)(0x42A69A0CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST4              (*((volatile unsigned int*)(0x42A69A10UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST5              (*((volatile unsigned int*)(0x42A69A14UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST6              (*((volatile unsigned int*)(0x42A69A18UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST7              (*((volatile unsigned int*)(0x42A69A1CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST8              (*((volatile unsigned int*)(0x42A69A20UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST9              (*((volatile unsigned int*)(0x42A69A24UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST10             (*((volatile unsigned int*)(0x42A69A28UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST11             (*((volatile unsigned int*)(0x42A69A2CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST12             (*((volatile unsigned int*)(0x42A69A30UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST13             (*((volatile unsigned int*)(0x42A69A34UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST14             (*((volatile unsigned int*)(0x42A69A38UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST15             (*((volatile unsigned int*)(0x42A69A3CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST16             (*((volatile unsigned int*)(0x42A69A40UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST17             (*((volatile unsigned int*)(0x42A69A44UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST18             (*((volatile unsigned int*)(0x42A69A48UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST19             (*((volatile unsigned int*)(0x42A69A4CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB0              (*((volatile unsigned int*)(0x42A69A50UL)))
