SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeua_template/common/hc32f460jeua.h
#define bM4_MPU_RGCR4_FRG4E                       (*((volatile unsigned int*)(0x42A00A5CUL)))
#define bM4_MPU_RGCR5_S2RG5RP                     (*((volatile unsigned int*)(0x42A00A80UL)))
#define bM4_MPU_RGCR5_S2RG5WP                     (*((volatile unsigned int*)(0x42A00A84UL)))
#define bM4_MPU_RGCR5_S2RG5E                      (*((volatile unsigned int*)(0x42A00A9CUL)))
#define bM4_MPU_RGCR5_S1RG5RP                     (*((volatile unsigned int*)(0x42A00AA0UL)))
#define bM4_MPU_RGCR5_S1RG5WP                     (*((volatile unsigned int*)(0x42A00AA4UL)))
#define bM4_MPU_RGCR5_S1RG5E                      (*((volatile unsigned int*)(0x42A00ABCUL)))
#define bM4_MPU_RGCR5_FRG5RP                      (*((volatile unsigned int*)(0x42A00AC0UL)))
#define bM4_MPU_RGCR5_FRG5WP                      (*((volatile unsigned int*)(0x42A00AC4UL)))
#define bM4_MPU_RGCR5_FRG5E                       (*((volatile unsigned int*)(0x42A00ADCUL)))
#define bM4_MPU_RGCR6_S2RG6RP                     (*((volatile unsigned int*)(0x42A00B00UL)))
#define bM4_MPU_RGCR6_S2RG6WP                     (*((volatile unsigned int*)(0x42A00B04UL)))
#define bM4_MPU_RGCR6_S2RG6E                      (*((volatile unsigned int*)(0x42A00B1CUL)))
#define bM4_MPU_RGCR6_S1RG6RP                     (*((volatile unsigned int*)(0x42A00B20UL)))
#define bM4_MPU_RGCR6_S1RG6WP                     (*((volatile unsigned int*)(0x42A00B24UL)))
#define bM4_MPU_RGCR6_S1RG6E                      (*((volatile unsigned int*)(0x42A00B3CUL)))
#define bM4_MPU_RGCR6_FRG6RP                      (*((volatile unsigned int*)(0x42A00B40UL)))
#define bM4_MPU_RGCR6_FRG6WP                      (*((volatile unsigned int*)(0x42A00B44UL)))
#define bM4_MPU_RGCR6_FRG6E                       (*((volatile unsigned int*)(0x42A00B5CUL)))
#define bM4_MPU_RGCR7_S2RG7RP                     (*((volatile unsigned int*)(0x42A00B80UL)))
#define bM4_MPU_RGCR7_S2RG7WP                     (*((volatile unsigned int*)(0x42A00B84UL)))
#define bM4_MPU_RGCR7_S2RG7E                      (*((volatile unsigned int*)(0x42A00B9CUL)))
#define bM4_MPU_RGCR7_S1RG7RP                     (*((volatile unsigned int*)(0x42A00BA0UL)))
#define bM4_MPU_RGCR7_S1RG7WP                     (*((volatile unsigned int*)(0x42A00BA4UL)))
#define bM4_MPU_RGCR7_S1RG7E                      (*((volatile unsigned int*)(0x42A00BBCUL)))
#define bM4_MPU_RGCR7_FRG7RP                      (*((volatile unsigned int*)(0x42A00BC0UL)))
#define bM4_MPU_RGCR7_FRG7WP                      (*((volatile unsigned int*)(0x42A00BC4UL)))
#define bM4_MPU_RGCR7_FRG7E                       (*((volatile unsigned int*)(0x42A00BDCUL)))
#define bM4_MPU_RGCR8_S2RG8RP                     (*((volatile unsigned int*)(0x42A00C00UL)))
#define bM4_MPU_RGCR8_S2RG8WP                     (*((volatile unsigned int*)(0x42A00C04UL)))
#define bM4_MPU_RGCR8_S2RG8E                      (*((volatile unsigned int*)(0x42A00C1CUL)))
#define bM4_MPU_RGCR8_S1RG8RP                     (*((volatile unsigned int*)(0x42A00C20UL)))
#define bM4_MPU_RGCR8_S1RG8WP                     (*((volatile unsigned int*)(0x42A00C24UL)))
#define bM4_MPU_RGCR8_S1RG8E                      (*((volatile unsigned int*)(0x42A00C3CUL)))
#define bM4_MPU_RGCR9_S2RG9RP                     (*((volatile unsigned int*)(0x42A00C80UL)))
#define bM4_MPU_RGCR9_S2RG9WP                     (*((volatile unsigned int*)(0x42A00C84UL)))
#define bM4_MPU_RGCR9_S2RG9E                      (*((volatile unsigned int*)(0x42A00C9CUL)))
#define bM4_MPU_RGCR9_S1RG9RP                     (*((volatile unsigned int*)(0x42A00CA0UL)))
#define bM4_MPU_RGCR9_S1RG9WP                     (*((volatile unsigned int*)(0x42A00CA4UL)))
#define bM4_MPU_RGCR9_S1RG9E                      (*((volatile unsigned int*)(0x42A00CBCUL)))
#define bM4_MPU_RGCR10_S2RG10RP                   (*((volatile unsigned int*)(0x42A00D00UL)))
#define bM4_MPU_RGCR10_S2RG10WP                   (*((volatile unsigned int*)(0x42A00D04UL)))
#define bM4_MPU_RGCR10_S2RG10E                    (*((volatile unsigned int*)(0x42A00D1CUL)))
#define bM4_MPU_RGCR10_S1RG10RP                   (*((volatile unsigned int*)(0x42A00D20UL)))
#define bM4_MPU_RGCR10_S1RG10WP                   (*((volatile unsigned int*)(0x42A00D24UL)))
#define bM4_MPU_RGCR10_S1RG10E                    (*((volatile unsigned int*)(0x42A00D3CUL)))
#define bM4_MPU_RGCR11_S2RG11RP                   (*((volatile unsigned int*)(0x42A00D80UL)))
#define bM4_MPU_RGCR11_S2RG11WP                   (*((volatile unsigned int*)(0x42A00D84UL)))
#define bM4_MPU_RGCR11_S2RG11E                    (*((volatile unsigned int*)(0x42A00D9CUL)))
#define bM4_MPU_RGCR11_S1RG11RP                   (*((volatile unsigned int*)(0x42A00DA0UL)))
#define bM4_MPU_RGCR11_S1RG11WP                   (*((volatile unsigned int*)(0x42A00DA4UL)))
#define bM4_MPU_RGCR11_S1RG11E                    (*((volatile unsigned int*)(0x42A00DBCUL)))
#define bM4_MPU_RGCR12_S2RG12RP                   (*((volatile unsigned int*)(0x42A00E00UL)))
#define bM4_MPU_RGCR12_S2RG12WP                   (*((volatile unsigned int*)(0x42A00E04UL)))
#define bM4_MPU_RGCR12_S2RG12E                    (*((volatile unsigned int*)(0x42A00E1CUL)))
#define bM4_MPU_RGCR12_S1RG12RP                   (*((volatile unsigned int*)(0x42A00E20UL)))
#define bM4_MPU_RGCR12_S1RG12WP                   (*((volatile unsigned int*)(0x42A00E24UL)))
#define bM4_MPU_RGCR12_S1RG12E                    (*((volatile unsigned int*)(0x42A00E3CUL)))
#define bM4_MPU_RGCR13_S2RG13RP                   (*((volatile unsigned int*)(0x42A00E80UL)))
#define bM4_MPU_RGCR13_S2RG13WP                   (*((volatile unsigned int*)(0x42A00E84UL)))
#define bM4_MPU_RGCR13_S2RG13E                    (*((volatile unsigned int*)(0x42A00E9CUL)))
#define bM4_MPU_RGCR13_S1RG13RP                   (*((volatile unsigned int*)(0x42A00EA0UL)))
#define bM4_MPU_RGCR13_S1RG13WP                   (*((volatile unsigned int*)(0x42A00EA4UL)))
#define bM4_MPU_RGCR13_S1RG13E                    (*((volatile unsigned int*)(0x42A00EBCUL)))
#define bM4_MPU_RGCR14_S2RG14RP                   (*((volatile unsigned int*)(0x42A00F00UL)))
#define bM4_MPU_RGCR14_S2RG14WP                   (*((volatile unsigned int*)(0x42A00F04UL)))
#define bM4_MPU_RGCR14_S2RG14E                    (*((volatile unsigned int*)(0x42A00F1CUL)))
#define bM4_MPU_RGCR14_S1RG14RP                   (*((volatile unsigned int*)(0x42A00F20UL)))
#define bM4_MPU_RGCR14_S1RG14WP                   (*((volatile unsigned int*)(0x42A00F24UL)))
#define bM4_MPU_RGCR14_S1RG14E                    (*((volatile unsigned int*)(0x42A00F3CUL)))
#define bM4_MPU_RGCR15_S2RG15RP                   (*((volatile unsigned int*)(0x42A00F80UL)))
#define bM4_MPU_RGCR15_S2RG15WP                   (*((volatile unsigned int*)(0x42A00F84UL)))
#define bM4_MPU_RGCR15_S2RG15E                    (*((volatile unsigned int*)(0x42A00F9CUL)))
#define bM4_MPU_RGCR15_S1RG15RP                   (*((volatile unsigned int*)(0x42A00FA0UL)))
#define bM4_MPU_RGCR15_S1RG15WP                   (*((volatile unsigned int*)(0x42A00FA4UL)))
#define bM4_MPU_RGCR15_S1RG15E                    (*((volatile unsigned int*)(0x42A00FBCUL)))
#define bM4_MPU_CR_SMPU2BRP                       (*((volatile unsigned int*)(0x42A01000UL)))
#define bM4_MPU_CR_SMPU2BWP                       (*((volatile unsigned int*)(0x42A01004UL)))
#define bM4_MPU_CR_SMPU2ACT0                      (*((volatile unsigned int*)(0x42A01008UL)))
#define bM4_MPU_CR_SMPU2ACT1                      (*((volatile unsigned int*)(0x42A0100CUL)))
#define bM4_MPU_CR_SMPU2E                         (*((volatile unsigned int*)(0x42A0101CUL)))
#define bM4_MPU_CR_SMPU1BRP                       (*((volatile unsigned int*)(0x42A01020UL)))
#define bM4_MPU_CR_SMPU1BWP                       (*((volatile unsigned int*)(0x42A01024UL)))
#define bM4_MPU_CR_SMPU1ACT0                      (*((volatile unsigned int*)(0x42A01028UL)))
#define bM4_MPU_CR_SMPU1ACT1                      (*((volatile unsigned int*)(0x42A0102CUL)))
#define bM4_MPU_CR_SMPU1E                         (*((volatile unsigned int*)(0x42A0103CUL)))
#define bM4_MPU_CR_FMPUBRP                        (*((volatile unsigned int*)(0x42A01040UL)))
#define bM4_MPU_CR_FMPUBWP                        (*((volatile unsigned int*)(0x42A01044UL)))
#define bM4_MPU_CR_FMPUACT0                       (*((volatile unsigned int*)(0x42A01048UL)))
#define bM4_MPU_CR_FMPUACT1                       (*((volatile unsigned int*)(0x42A0104CUL)))
#define bM4_MPU_CR_FMPUE                          (*((volatile unsigned int*)(0x42A0105CUL)))
#define bM4_MPU_SR_SMPU2EAF                       (*((volatile unsigned int*)(0x42A01080UL)))
#define bM4_MPU_SR_SMPU1EAF                       (*((volatile unsigned int*)(0x42A010A0UL)))
#define bM4_MPU_SR_FMPUEAF                        (*((volatile unsigned int*)(0x42A010C0UL)))
#define bM4_MPU_ECLR_SMPU2ECLR                    (*((volatile unsigned int*)(0x42A01100UL)))
#define bM4_MPU_ECLR_SMPU1ECLR                    (*((volatile unsigned int*)(0x42A01120UL)))
#define bM4_MPU_ECLR_FMPUECLR                     (*((volatile unsigned int*)(0x42A01140UL)))
#define bM4_MPU_WP_MPUWE                          (*((volatile unsigned int*)(0x42A01180UL)))
#define bM4_MPU_WP_WKEY0                          (*((volatile unsigned int*)(0x42A01184UL)))
#define bM4_MPU_WP_WKEY1                          (*((volatile unsigned int*)(0x42A01188UL)))
#define bM4_MPU_WP_WKEY2                          (*((volatile unsigned int*)(0x42A0118CUL)))
#define bM4_MPU_WP_WKEY3                          (*((volatile unsigned int*)(0x42A01190UL)))
#define bM4_MPU_WP_WKEY4                          (*((volatile unsigned int*)(0x42A01194UL)))
#define bM4_MPU_WP_WKEY5                          (*((volatile unsigned int*)(0x42A01198UL)))
#define bM4_MPU_WP_WKEY6                          (*((volatile unsigned int*)(0x42A0119CUL)))
#define bM4_MPU_WP_WKEY7                          (*((volatile unsigned int*)(0x42A011A0UL)))
#define bM4_MPU_WP_WKEY8                          (*((volatile unsigned int*)(0x42A011A4UL)))
#define bM4_MPU_WP_WKEY9                          (*((volatile unsigned int*)(0x42A011A8UL)))
#define bM4_MPU_WP_WKEY10                         (*((volatile unsigned int*)(0x42A011ACUL)))
#define bM4_MPU_WP_WKEY11                         (*((volatile unsigned int*)(0x42A011B0UL)))
#define bM4_MPU_WP_WKEY12                         (*((volatile unsigned int*)(0x42A011B4UL)))
#define bM4_MPU_WP_WKEY13                         (*((volatile unsigned int*)(0x42A011B8UL)))
#define bM4_MPU_WP_WKEY14                         (*((volatile unsigned int*)(0x42A011BCUL)))
#define bM4_MSTP_FCG0_SRAMH                       (*((volatile unsigned int*)(0x42900000UL)))
#define bM4_MSTP_FCG0_SRAM12                      (*((volatile unsigned int*)(0x42900010UL)))
#define bM4_MSTP_FCG0_SRAM3                       (*((volatile unsigned int*)(0x42900020UL)))
#define bM4_MSTP_FCG0_SRAMRET                     (*((volatile unsigned int*)(0x42900028UL)))
#define bM4_MSTP_FCG0_DMA1                        (*((volatile unsigned int*)(0x42900038UL)))
#define bM4_MSTP_FCG0_DMA2                        (*((volatile unsigned int*)(0x4290003CUL)))
#define bM4_MSTP_FCG0_FCM                         (*((volatile unsigned int*)(0x42900040UL)))
#define bM4_MSTP_FCG0_AOS                         (*((volatile unsigned int*)(0x42900044UL)))
#define bM4_MSTP_FCG0_AES                         (*((volatile unsigned int*)(0x42900050UL)))
#define bM4_MSTP_FCG0_HASH                        (*((volatile unsigned int*)(0x42900054UL)))
#define bM4_MSTP_FCG0_TRNG                        (*((volatile unsigned int*)(0x42900058UL)))
#define bM4_MSTP_FCG0_CRC                         (*((volatile unsigned int*)(0x4290005CUL)))
#define bM4_MSTP_FCG0_DCU1                        (*((volatile unsigned int*)(0x42900060UL)))
#define bM4_MSTP_FCG0_DCU2                        (*((volatile unsigned int*)(0x42900064UL)))
#define bM4_MSTP_FCG0_DCU3                        (*((volatile unsigned int*)(0x42900068UL)))
#define bM4_MSTP_FCG0_DCU4                        (*((volatile unsigned int*)(0x4290006CUL)))
#define bM4_MSTP_FCG0_KEY                         (*((volatile unsigned int*)(0x4290007CUL)))
#define bM4_MSTP_FCG1_CAN                         (*((volatile unsigned int*)(0x42900080UL)))
#define bM4_MSTP_FCG1_QSPI                        (*((volatile unsigned int*)(0x4290008CUL)))
#define bM4_MSTP_FCG1_IIC1                        (*((volatile unsigned int*)(0x42900090UL)))
#define bM4_MSTP_FCG1_IIC2                        (*((volatile unsigned int*)(0x42900094UL)))
#define bM4_MSTP_FCG1_IIC3                        (*((volatile unsigned int*)(0x42900098UL)))
#define bM4_MSTP_FCG1_USBFS                       (*((volatile unsigned int*)(0x429000A0UL)))
#define bM4_MSTP_FCG1_SDIOC1                      (*((volatile unsigned int*)(0x429000A8UL)))
#define bM4_MSTP_FCG1_SDIOC2                      (*((volatile unsigned int*)(0x429000ACUL)))
#define bM4_MSTP_FCG1_I2S1                        (*((volatile unsigned int*)(0x429000B0UL)))
#define bM4_MSTP_FCG1_I2S2                        (*((volatile unsigned int*)(0x429000B4UL)))
#define bM4_MSTP_FCG1_I2S3                        (*((volatile unsigned int*)(0x429000B8UL)))
#define bM4_MSTP_FCG1_I2S4                        (*((volatile unsigned int*)(0x429000BCUL)))
#define bM4_MSTP_FCG1_SPI1                        (*((volatile unsigned int*)(0x429000C0UL)))
#define bM4_MSTP_FCG1_SPI2                        (*((volatile unsigned int*)(0x429000C4UL)))
#define bM4_MSTP_FCG1_SPI3                        (*((volatile unsigned int*)(0x429000C8UL)))
#define bM4_MSTP_FCG1_SPI4                        (*((volatile unsigned int*)(0x429000CCUL)))
#define bM4_MSTP_FCG1_USART1                      (*((volatile unsigned int*)(0x429000E0UL)))
#define bM4_MSTP_FCG1_USART2                      (*((volatile unsigned int*)(0x429000E4UL)))
#define bM4_MSTP_FCG1_USART3                      (*((volatile unsigned int*)(0x429000E8UL)))
#define bM4_MSTP_FCG1_USART4                      (*((volatile unsigned int*)(0x429000ECUL)))
#define bM4_MSTP_FCG2_TIMER0_1                    (*((volatile unsigned int*)(0x42900100UL)))
#define bM4_MSTP_FCG2_TIMER0_2                    (*((volatile unsigned int*)(0x42900104UL)))
#define bM4_MSTP_FCG2_TIMERA_1                    (*((volatile unsigned int*)(0x42900108UL)))
#define bM4_MSTP_FCG2_TIMERA_2                    (*((volatile unsigned int*)(0x4290010CUL)))
#define bM4_MSTP_FCG2_TIMERA_3                    (*((volatile unsigned int*)(0x42900110UL)))
#define bM4_MSTP_FCG2_TIMERA_4                    (*((volatile unsigned int*)(0x42900114UL)))
#define bM4_MSTP_FCG2_TIMERA_5                    (*((volatile unsigned int*)(0x42900118UL)))
#define bM4_MSTP_FCG2_TIMERA_6                    (*((volatile unsigned int*)(0x4290011CUL)))
#define bM4_MSTP_FCG2_TIMER4_1                    (*((volatile unsigned int*)(0x42900120UL)))
#define bM4_MSTP_FCG2_TIMER4_2                    (*((volatile unsigned int*)(0x42900124UL)))
#define bM4_MSTP_FCG2_TIMER4_3                    (*((volatile unsigned int*)(0x42900128UL)))
#define bM4_MSTP_FCG2_EMB                         (*((volatile unsigned int*)(0x4290013CUL)))
#define bM4_MSTP_FCG2_TIMER6_1                    (*((volatile unsigned int*)(0x42900140UL)))
#define bM4_MSTP_FCG2_TIMER6_2                    (*((volatile unsigned int*)(0x42900144UL)))
#define bM4_MSTP_FCG2_TIMER6_3                    (*((volatile unsigned int*)(0x42900148UL)))
#define bM4_MSTP_FCG3_ADC1                        (*((volatile unsigned int*)(0x42900180UL)))
#define bM4_MSTP_FCG3_ADC2                        (*((volatile unsigned int*)(0x42900184UL)))
#define bM4_MSTP_FCG3_CMP                         (*((volatile unsigned int*)(0x429001A0UL)))
#define bM4_MSTP_FCG3_OTS                         (*((volatile unsigned int*)(0x429001B0UL)))
#define bM4_MSTP_FCG0PC_PRT0                      (*((volatile unsigned int*)(0x42900200UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE0                 (*((volatile unsigned int*)(0x42900240UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE1                 (*((volatile unsigned int*)(0x42900244UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE2                 (*((volatile unsigned int*)(0x42900248UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE3                 (*((volatile unsigned int*)(0x4290024CUL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE4                 (*((volatile unsigned int*)(0x42900250UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE5                 (*((volatile unsigned int*)(0x42900254UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE6                 (*((volatile unsigned int*)(0x42900258UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE7                 (*((volatile unsigned int*)(0x4290025CUL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE8                 (*((volatile unsigned int*)(0x42900260UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE9                 (*((volatile unsigned int*)(0x42900264UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE10                (*((volatile unsigned int*)(0x42900268UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE11                (*((volatile unsigned int*)(0x4290026CUL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE12                (*((volatile unsigned int*)(0x42900270UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE13                (*((volatile unsigned int*)(0x42900274UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE14                (*((volatile unsigned int*)(0x42900278UL)))
#define bM4_MSTP_FCG0PC_FCG0PCWE15                (*((volatile unsigned int*)(0x4290027CUL)))
#define bM4_OTS_CTL_OTSST                         (*((volatile unsigned int*)(0x42948000UL)))
#define bM4_OTS_CTL_OTSCK                         (*((volatile unsigned int*)(0x42948004UL)))
#define bM4_OTS_CTL_OTSIE                         (*((volatile unsigned int*)(0x42948008UL)))
#define bM4_OTS_CTL_TSSTP                         (*((volatile unsigned int*)(0x4294800CUL)))
#define bM4_OTS_LPR_TSOFS0                        (*((volatile unsigned int*)(0x42948100UL)))
#define bM4_OTS_LPR_TSOFS1                        (*((volatile unsigned int*)(0x42948104UL)))
#define bM4_OTS_LPR_TSOFS2                        (*((volatile unsigned int*)(0x42948108UL)))
#define bM4_OTS_LPR_TSOFS3                        (*((volatile unsigned int*)(0x4294810CUL)))
#define bM4_OTS_LPR_TSOFS4                        (*((volatile unsigned int*)(0x42948110UL)))
#define bM4_OTS_LPR_TSOFS5                        (*((volatile unsigned int*)(0x42948114UL)))
#define bM4_OTS_LPR_TSOFS6                        (*((volatile unsigned int*)(0x42948118UL)))
#define bM4_OTS_LPR_TSOFS7                        (*((volatile unsigned int*)(0x4294811CUL)))
#define bM4_OTS_LPR_TSSLP0                        (*((volatile unsigned int*)(0x42948120UL)))
#define bM4_OTS_LPR_TSSLP1                        (*((volatile unsigned int*)(0x42948124UL)))
#define bM4_OTS_LPR_TSSLP2                        (*((volatile unsigned int*)(0x42948128UL)))
#define bM4_OTS_LPR_TSSLP3                        (*((volatile unsigned int*)(0x4294812CUL)))
#define bM4_OTS_LPR_TSSLP4                        (*((volatile unsigned int*)(0x42948130UL)))
#define bM4_OTS_LPR_TSSLP5                        (*((volatile unsigned int*)(0x42948134UL)))
#define bM4_OTS_LPR_TSSLP6                        (*((volatile unsigned int*)(0x42948138UL)))
#define bM4_OTS_LPR_TSSLP7                        (*((volatile unsigned int*)(0x4294813CUL)))
#define bM4_OTS_LPR_TSSLP8                        (*((volatile unsigned int*)(0x42948140UL)))
#define bM4_OTS_LPR_TSSLP9                        (*((volatile unsigned int*)(0x42948144UL)))
#define bM4_OTS_LPR_TSSLP10                       (*((volatile unsigned int*)(0x42948148UL)))
#define bM4_OTS_LPR_TSSLP11                       (*((volatile unsigned int*)(0x4294814CUL)))
#define bM4_OTS_LPR_TSSLP12                       (*((volatile unsigned int*)(0x42948150UL)))
#define bM4_OTS_LPR_TSSLP13                       (*((volatile unsigned int*)(0x42948154UL)))
#define bM4_OTS_LPR_TSSLP14                       (*((volatile unsigned int*)(0x42948158UL)))
#define bM4_OTS_LPR_TSSLP15                       (*((volatile unsigned int*)(0x4294815CUL)))
#define bM4_OTS_LPR_TSSLP16                       (*((volatile unsigned int*)(0x42948160UL)))
#define bM4_OTS_LPR_TSSLP17                       (*((volatile unsigned int*)(0x42948164UL)))
#define bM4_OTS_LPR_TSSLP18                       (*((volatile unsigned int*)(0x42948168UL)))
#define bM4_OTS_LPR_TSSLP19                       (*((volatile unsigned int*)(0x4294816CUL)))
#define bM4_OTS_LPR_TSSLP20                       (*((volatile unsigned int*)(0x42948170UL)))
#define bM4_OTS_LPR_TSSLP21                       (*((volatile unsigned int*)(0x42948174UL)))
#define bM4_OTS_LPR_TSSLP22                       (*((volatile unsigned int*)(0x42948178UL)))
#define bM4_OTS_LPR_TSSLP23                       (*((volatile unsigned int*)(0x4294817CUL)))
#define bM4_PERIC_USBFS_SYCTLREG_DFB              (*((volatile unsigned int*)(0x42AA8000UL)))
#define bM4_PERIC_USBFS_SYCTLREG_SOFEN            (*((volatile unsigned int*)(0x42AA8004UL)))
#define bM4_PERIC_SDIOC_SYCTLREG_SELMMC1          (*((volatile unsigned int*)(0x42AA8084UL)))
#define bM4_PERIC_SDIOC_SYCTLREG_SELMMC2          (*((volatile unsigned int*)(0x42AA808CUL)))
#define bM4_PORT_PIDRA_PIN00                      (*((volatile unsigned int*)(0x42A70000UL)))
#define bM4_PORT_PIDRA_PIN01                      (*((volatile unsigned int*)(0x42A70004UL)))
#define bM4_PORT_PIDRA_PIN02                      (*((volatile unsigned int*)(0x42A70008UL)))
#define bM4_PORT_PIDRA_PIN03                      (*((volatile unsigned int*)(0x42A7000CUL)))
#define bM4_PORT_PIDRA_PIN04                      (*((volatile unsigned int*)(0x42A70010UL)))
#define bM4_PORT_PIDRA_PIN05                      (*((volatile unsigned int*)(0x42A70014UL)))
#define bM4_PORT_PIDRA_PIN06                      (*((volatile unsigned int*)(0x42A70018UL)))
#define bM4_PORT_PIDRA_PIN07                      (*((volatile unsigned int*)(0x42A7001CUL)))
#define bM4_PORT_PIDRA_PIN08                      (*((volatile unsigned int*)(0x42A70020UL)))
#define bM4_PORT_PIDRA_PIN09                      (*((volatile unsigned int*)(0x42A70024UL)))
#define bM4_PORT_PIDRA_PIN10                      (*((volatile unsigned int*)(0x42A70028UL)))
#define bM4_PORT_PIDRA_PIN11                      (*((volatile unsigned int*)(0x42A7002CUL)))
#define bM4_PORT_PIDRA_PIN12                      (*((volatile unsigned int*)(0x42A70030UL)))
#define bM4_PORT_PIDRA_PIN13                      (*((volatile unsigned int*)(0x42A70034UL)))
#define bM4_PORT_PIDRA_PIN14                      (*((volatile unsigned int*)(0x42A70038UL)))
#define bM4_PORT_PIDRA_PIN15                      (*((volatile unsigned int*)(0x42A7003CUL)))
#define bM4_PORT_PODRA_POUT00                     (*((volatile unsigned int*)(0x42A70080UL)))
#define bM4_PORT_PODRA_POUT01                     (*((volatile unsigned int*)(0x42A70084UL)))
#define bM4_PORT_PODRA_POUT02                     (*((volatile unsigned int*)(0x42A70088UL)))
#define bM4_PORT_PODRA_POUT03                     (*((volatile unsigned int*)(0x42A7008CUL)))
#define bM4_PORT_PODRA_POUT04                     (*((volatile unsigned int*)(0x42A70090UL)))
#define bM4_PORT_PODRA_POUT05                     (*((volatile unsigned int*)(0x42A70094UL)))
#define bM4_PORT_PODRA_POUT06                     (*((volatile unsigned int*)(0x42A70098UL)))
#define bM4_PORT_PODRA_POUT07                     (*((volatile unsigned int*)(0x42A7009CUL)))
#define bM4_PORT_PODRA_POUT08                     (*((volatile unsigned int*)(0x42A700A0UL)))
#define bM4_PORT_PODRA_POUT09                     (*((volatile unsigned int*)(0x42A700A4UL)))
#define bM4_PORT_PODRA_POUT10                     (*((volatile unsigned int*)(0x42A700A8UL)))
#define bM4_PORT_PODRA_POUT11                     (*((volatile unsigned int*)(0x42A700ACUL)))
#define bM4_PORT_PODRA_POUT12                     (*((volatile unsigned int*)(0x42A700B0UL)))
